In [1]:
import pandas as pd

In [2]:
# importaciones
from pandas import Series, isnull, DataFrame

In [3]:
# series
obj = Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4,7,-5,3], index=['d','b','a','c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 6

In [11]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [12]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [14]:
obj3 = Series(sdata)

In [15]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [17]:
obj4 = Series(sdata, index = states)

In [18]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [22]:
# data frame, agrupacion de series, matris multidimencional

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [23]:
# crear data frame con base a un objeto

frame = DataFrame(data)

In [24]:
# ver index del data frame

frame.index

RangeIndex(start=0, stop=5, step=1)

In [25]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [26]:
# agregar u ordenar columnas al data frame

DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [27]:
# modificar nombre de index en data frame

frame2 = DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], index = ['one', 'two', 'three', 'four', 'five'])

In [28]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [29]:
#ver valores del data frame

frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan]], dtype=object)

In [30]:
#elegir un valor del dataframe

frame2['year']['one']

2000

In [31]:
# setear una columna completa en el data frame

frame2['debt'] = 16.5

In [32]:
val = Series([-1.2, -1.5,-1.7], index = ['two', 'four', 'five'])

In [33]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [34]:
# asignar valores de la serie que coincidan con los index del dataframe

frame2['debt'] = val

In [35]:

frame2['debt'].fillna(0, inplace=True)

In [36]:
#asignar booleano a una columna nueva del dataframe

frame2['eastern'] = frame2.state == 'Ohio'

In [37]:
# eliminar columna del data frame

del frame2['eastern']

In [38]:
#ver columnas del data frame

frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [39]:
#ver tipo de datos del data frame

frame2.dtypes

year       int64
state     object
pop      float64
debt     float64
dtype: object

In [40]:
#ver tama√±o de la matriz del data frame

frame2.shape

(5, 4)

In [41]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [44]:
frame3 = DataFrame(pop)

In [45]:
# transponer DataFrame

frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [46]:
DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [47]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [48]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5